{
  "visual_events": [
    {
      "timestamp": "00:00",
      "description": "The video starts with a POV shot from someone holding a wooden beam, showing a construction site with a concrete slab foundation and some wooden framing already up."
    },
    {
      "timestamp": "00:04",
      "description": "The person is looking down a ladder and then climbing up some wooden framing."
    },
    {
      "timestamp": "00:11",
      "description": "A worker in a neon yellow shirt and black vest appears, holding a tool. The camera pans around the wooden framework."
    },
    {
      "timestamp": "00:26",
      "description": "The person picks up a long wooden beam and carries it."
    },
    {
      "timestamp": "00:54",
      "description": "The person starts using a nail gun on a wooden beam on the frame."
    },
    {
      "timestamp": "01:25",
      "description": "The camera is focused on the nail gun as it shoots a nail into the wood."
    },
    {
      "timestamp": "02:05",
      "description": "The person in neon yellow gives the nail gun to the person filming."
    },
    {
      "timestamp": "02:23",
      "description": "The person in neon yellow takes the nail gun back and climbs down the ladder."
    },
    {
      "timestamp": "02:55",
      "description": "The person is nailing a long wooden beam."
    },
    {
      "timestamp": "03:08",
      "description": "The person uses the nail gun to secure a connection on the wooden frame."
    },
    {
      "timestamp": "03:20",
      "description": "The person in neon yellow brings over a metal truss piece."
    },
    {
      "timestamp": "03:36",
      "description": "The person marks measurements on the wooden beam using the tape."
    },
    {
      "timestamp": "03:41",
      "description": "The person uses a speed square to mark a perpendicular line on the wood."
    },
    {
      "timestamp": "04:10",
      "description": "The person with the camera grabs the measuring tape."
    },
    {
      "timestamp": "05:10",
      "description": "The person marks the beam with a marker."
    },
    {
      "timestamp": "05:45",
      "description": "The person marks a large 'X' on the beam."
    },
    {
      "timestamp": "06:35",
      "description": "The person marks the beam with a speed square."
    },
    {
      "timestamp": "07:35",
      "description": "The person in neon yellow picks up a large metal truss."
    },
    {
      "timestamp": "07:45",
      "description": "The worker in neon yellow starts placing the truss on the frame."
    },
    {
      "timestamp": "08:45",
      "description": "The worker in neon yellow carries the truss over to the frame."
    },
    {
      "timestamp": "09:05",
      "description": "The worker holds the truss in place."
    },
    {
      "timestamp": "09:55",
      "description": "The worker in neon yellow is attaching the truss using a drill."
    },
    {
      "timestamp": "10:05",
      "description": "The camera shows the drill screwing a fastener into the wood."
    },
    {
      "timestamp": "11:05",
      "description": "The drill is screwing a fastener into the truss."
    },
    {
      "timestamp": "11:35",
      "description": "The camera pans to show the drilling process."
    },
    {
      "timestamp": "12:35",
      "description": "The worker lifts a yellow laminated veneer lumber (LVL) beam."
    },
    {
      "timestamp": "13:05",
      "description": "The worker lifts the LVL beam higher."
    },
    {
      "timestamp": "13:35",
      "description": "The worker drills a fastener into the LVL beam."
    },
    {
      "timestamp": "14:05",
      "description": "The drill is screwing a fastener into the LVL beam."
    },
    {
      "timestamp": "14:35",
      "description": "The worker uses a speed square and marks the LVL beam."
    },
    {
      "timestamp": "15:05",
      "description": "The worker drills a fastener into the LVL beam."
    },
    {
      "timestamp": "15:15",
      "description": "The worker helps adjust a new truss."
    },
    {
      "timestamp": "15:45",
      "description": "The worker drills a fastener into the truss."
    }
  ]
}