{
  "visual_events": [
    {
      "timestamp": "00:00",
      "description": "The video starts with a dynamic shot of a lively street at night, bustling with people. A prominent neon sign for 'OCCO' (Rocco) is visible above a bar/restaurant. The street is lined with shops and food stalls."
    },
    {
      "timestamp": "00:02",
      "description": "The camera smoothly tracks backward, showing more of the busy street with numerous people walking and some standing. The 'OCCO' sign remains visible in the background."
    },
    {
      "timestamp": "00:07",
      "description": "The camera continues to track backward down the bustling night street, revealing a wider perspective of the vibrant atmosphere with various shops and street vendors. People are seen conversing, walking, and looking at stalls."
    },
    {
      "timestamp": "00:10",
      "description": "A slightly lower angle shot continues tracking backward, emphasizing the pedestrian traffic and the general flow of people on the busy street."
    },
    {
      "timestamp": "00:18",
      "description": "The camera continues moving backward, maintaining the same perspective, showing more people walking and the diverse range of street food stalls and shops."
    },
    {
      "timestamp": "00:26",
      "description": "The camera keeps tracking backward down the vibrant street, capturing more of the evening activity and the illuminated storefronts."
    },
    {
      "timestamp": "00:33",
      "description": "The shot continues to move backward, showcasing the long stretch of the night market street, with pedestrians and more food stalls becoming visible."
    },
    {
      "timestamp": "00:41",
      "description": "The camera pans slightly to the right, focusing on the various street food stalls that line the left side of the road. People are browsing and buying food."
    },
    {
      "timestamp": "00:49",
      "description": "The camera continues panning right, revealing more street vendors selling food and drinks, with people interacting with the stalls."
    },
    {
      "timestamp": "00:54",
      "description": "The camera continues its rightward pan, showing more of the lively street with street food stalls and people walking."
    },
    {
      "timestamp": "00:58",
      "description": "The camera continues panning right, passing a clothing stall, and revealing more of the vibrant night market."
    },
    {
      "timestamp": "01:04",
      "description": "The camera continues its rightward pan, showcasing a wide variety of clothing and souvenir stalls lining the street, with shoppers browsing."
    },
    {
      "timestamp": "01:09",
      "description": "The camera continues panning right, providing a broader view of the bustling night market with various stalls and many people walking around."
    },
    {
      "timestamp": "01:14",
      "description": "The camera continues panning right, emphasizing the density of the market stalls and the large number of people enjoying the evening."
    },
    {
      "timestamp": "01:20",
      "description": "The camera transitions into a steady shot, showing a section of the street dominated by clothing and bag stalls, with people walking past."
    },
    {
      "timestamp": "01:28",
      "description": "The camera pans to the left and moves slightly forward, revealing an entrance to an alleyway with a large inflatable character and a sign that says 'Mischa Cheap' and 'GARDEN WITH NOT VERY LOUD MUSIC INSIDE.'"
    },
    {
      "timestamp": "01:36",
      "description": "The camera moves into the alleyway, showcasing the 'Mischa Cheap' entrance marked by neon lights and a series of arched frames, leading into a more secluded area."
    },
    {
      "timestamp": "01:40",
      "description": "The camera moves deeper into the alleyway, with neon lights and decorative elements on either side. A security guard is visible on the right."
    },
    {
      "timestamp": "01:45",
      "description": "The camera continues moving forward through the alleyway, offering a view of the illuminated path and a person seated on a stool near the entrance."
    },
    {
      "timestamp": "01:50",
      "description": "The camera moves closer, focusing on the entrance area with colorful lights and a sign that reads 'WELCOME OUR BARNAME IS MISCHA CHEAP OUR MILKSHAKE BRINGS ALL THE BOYS TO THE YARD.'"
    },
    {
      "timestamp": "01:56",
      "description": "The camera pans to the left, showing the interior of the 'Mischa Cheap' bar/restaurant area, with tables, chairs, and a relaxed atmosphere. There are also signs for recycling bins."
    },
    {
      "timestamp": "02:00",
      "description": "The camera pans further left, providing a wider view of the 'Mischa Cheap' outdoor seating area, with patrons enjoying their time."
    },
    {
      "timestamp": "02:04",
      "description": "The camera continues panning left, showing more of the spacious open-air bar/restaurant, with various seating arrangements and decorative lighting."
    },
    {
      "timestamp": "02:08",
      "description": "The camera pans right, showing the recycling bins and green plants, before revealing more of the bar's interior and projected lights on the walls."
    },
    {
      "timestamp": "02:13",
      "description": "The camera continues panning right, showing the illuminated walkway with neon light frames, leading back towards the main street."
    },
    {
      "timestamp": "02:17",
      "description": "The camera pans up, showing the 'FIRE EXIT' sign above the entrance, and the decorative lights strung across the alleyway."
    },
    {
      "timestamp": "02:22",
      "description": "The camera pans down and continues its rightward pan, revealing more of the entrance, the yellow letter lights spelling 'CHEAP,' and the overall atmosphere of the alleyway."
    },
    {
      "timestamp": "02:27",
      "description": "The camera continues panning right, focusing on the entrance of the alleyway with more decorative lights and a 'WELCOME' sign, as people approach from the main street."
    },
    {
      "timestamp": "02:32",
      "description": "The camera continues panning right, offering a view of people walking through the illuminated alleyway entrance from the main street."
    },
    {
      "timestamp": "02:37",
      "description": "The camera continues panning right, providing a wider view of the alleyway leading back to the bustling night market street."
    },
    {
      "timestamp": "02:45",
      "description": "The camera pans further right, showing the continuation of the night market with clothing and bag stalls, as well as a McDonald's sign in the background."
    },
    {
      "timestamp": "02:50",
      "description": "The camera continues panning right, showing the full width of the night market street, with various stalls, restaurants, and a large crowd of people."
    },
    {
      "timestamp": "02:55",
      "description": "The camera continues its final pan to the right, capturing the lively and extensive night market with all its activity and bright lights."
    }
  ]
}