{
  "visual_events": [
    {
      "timestamp": "00:00",
      "description": "Inside the helicopter, showing the patient on a stretcher with medical equipment and two medical personnel."
    },
    {
      "timestamp": "00:05",
      "description": "View from the helicopter window showing a grassy field with trees and a few vehicles in the distance, indicating a landing or takeoff zone."
    },
    {
      "timestamp": "00:09",
      "description": "Inside the helicopter, showing the medical personnel attending to the patient, with one person looking at a monitor displaying vital signs."
    },
    {
      "timestamp": "00:26",
      "description": "View from the helicopter window as it takes off, showing the ground receding and green fields with trees."
    },
    {
      "timestamp": "00:33",
      "description": "One medical personnel looking out the window, observing the landscape as the helicopter ascends."
    },
    {
      "timestamp": "00:41",
      "description": "Medical personnel checking the patient's vitals on the monitor and writing on a clipboard."
    },
    {
      "timestamp": "00:51",
      "description": "Medical personnel communicating via headset while monitoring the patient."
    },
    {
      "timestamp": "01:09",
      "description": "Overhead view from inside the helicopter, showing the patient and medical personnel, with a view of green fields and a river below."
    },
    {
      "timestamp": "01:19",
      "description": "Medical personnel continuing to monitor the patient and document observations."
    },
    {
      "timestamp": "01:41",
      "description": "Medical personnel communicating via headset and pointing at the patient monitor."
    },
    {
      "timestamp": "02:00",
      "description": "Medical personnel communicating on the radio and listening intently."
    },
    {
      "timestamp": "02:18",
      "description": "One medical personnel writing on a clipboard and the other attending to the patient."
    },
    {
      "timestamp": "02:44",
      "description": "Close-up of the medical personnel writing on a clipboard and interacting with the patient."
    },
    {
      "timestamp": "02:50",
      "description": "Medical personnel speaking into their headset while observing the patient and writing."
    },
    {
      "timestamp": "03:19",
      "description": "Medical personnel with a masked face is talking on radio and making notes."
    },
    {
      "timestamp": "03:56",
      "description": "Medical personnel looking at the patient monitor and making notes."
    },
    {
      "timestamp": "04:36",
      "description": "Medical personnel showing a peace sign and giving a thumbs up to the camera."
    },
    {
      "timestamp": "05:05",
      "description": "Medical personnel looking at the monitor and then at the camera, then continuing to write."
    },
    {
      "timestamp": "05:40",
      "description": "Medical personnel making notes on a clipboard and then looking out the window."
    },
    {
      "timestamp": "06:10",
      "description": "Medical personnel turning to show the clipboard and then looking back to their work."
    },
    {
      "timestamp": "06:27",
      "description": "Medical personnel adjusting equipment on the ceiling of the helicopter."
    },
    {
      "timestamp": "07:05",
      "description": "Medical personnel adjusting the patient's blankets and then returning to their notes."
    },
    {
      "timestamp": "07:30",
      "description": "View from the window showing the vast landscape below, with fields, roads, and a river."
    },
    {
      "timestamp": "07:35",
      "description": "Medical personnel checking the patient and communicating through the headset."
    },
    {
      "timestamp": "07:54",
      "description": "Medical personnel explaining something to the patient and looking out the window."
    },
    {
      "timestamp": "08:10",
      "description": "Medical personnel preparing an IV bag."
    },
    {
      "timestamp": "08:25",
      "description": "Aerial view of the landscape from the helicopter window, showing fields, roads, and a river from a higher altitude."
    }
  ]
}