{
  "visual_events": [
    {
      "timestamp": "00:00",
      "description": "Two men are standing in a dry grassy field, talking, with other vehicles and people visible in the distance under a bright sunny sky."
    },
    {
      "timestamp": "00:20",
      "description": "A man in a black uniform with 'Trauma Flight' on his cap and blue gloves is pointing towards the blue and white helicopter behind him."
    },
    {
      "timestamp": "00:30",
      "description": "The man in the 'Trauma Flight' uniform points at several medical bags laid out on the ground near the helicopter's tail rotor."
    },
    {
      "timestamp": "00:50",
      "description": "A stretcher is placed on the ground next to the helicopter, ready for a patient."
    },
    {
      "timestamp": "01:00",
      "description": "Another man in a black uniform walks towards the helicopter, carrying medical bags."
    },
    {
      "timestamp": "01:25",
      "description": "A wide shot shows the white and blue 'Custom Trauma Flight' helicopter parked in the field, with people and vehicles in the background."
    },
    {
      "timestamp": "01:50",
      "description": "A man in a flight suit stands next to the helicopter's nose, looking at the camera, while other personnel are in the distance."
    },
    {
      "timestamp": "02:25",
      "description": "An ambulance drives into view in the distance, heading towards the helicopter."
    },
    {
      "timestamp": "02:50",
      "description": "The ambulance is seen backing up towards the helicopter, its rear displaying 'Ambulance Manitoba'."
    },
    {
      "timestamp": "03:40",
      "description": "The side door of the ambulance is open, revealing two paramedics and a patient on a stretcher inside the vehicle."
    },
    {
      "timestamp": "03:50",
      "description": "A female paramedic in a mask and high-visibility vest is attending to the patient inside the ambulance, holding an IV bag."
    },
    {
      "timestamp": "04:00",
      "description": "A male medical professional in a black uniform joins the female paramedic inside the ambulance, assessing the patient and medical equipment."
    },
    {
      "timestamp": "04:50",
      "description": "The paramedics are seen exiting the ambulance, while the 'Trauma Flight' helicopter remains visible in the background."
    },
    {
      "timestamp": "05:00",
      "description": "Several medical personnel are gathered in the field, near the ambulance and helicopter."
    },
    {
      "timestamp": "05:30",
      "description": "A mannequin, dressed in a red vest and plaid pants, is lying on the ground, representing a patient, near a black pickup truck."
    },
    {
      "timestamp": "05:40",
      "description": "Medical personnel gather around the mannequin and various medical bags and equipment on the ground."
    },
    {
      "timestamp": "05:50",
      "description": "A man begins performing chest compressions on the mannequin, simulating CPR."
    },
    {
      "timestamp": "06:10",
      "description": "A male medical professional prepares a bag-valve mask (BVM) and other equipment while CPR is ongoing."
    },
    {
      "timestamp": "06:30",
      "description": "Another medical professional carries a Lucas device (mechanical CPR device) towards the mannequin."
    },
    {
      "timestamp": "06:45",
      "description": "The medical team is actively engaged in the simulated resuscitation, with multiple members tending to the mannequin and equipment."
    },
    {
      "timestamp": "07:00",
      "description": "A female paramedic is seen preparing an IV line and medication."
    },
    {
      "timestamp": "07:20",
      "description": "The team continues to perform CPR and manage the resuscitation, discussing defibrillation and medication administration."
    },
    {
      "timestamp": "07:40",
      "description": "The Lucas device is being positioned and set up over the mannequin for automated chest compressions."
    },
    {
      "timestamp": "08:00",
      "description": "The medical team is focused on the mannequin, with various roles being performed including CPR, medication preparation, and equipment management."
    },
    {
      "timestamp": "08:20",
      "description": "The scene shows the intensive efforts of the medical team in the simulated emergency, working around the mannequin."
    },
    {
      "timestamp": "08:40",
      "description": "The Lucas device is actively engaged, performing automated chest compressions on the mannequin."
    }
  ]
}